# CreateNewXMLDocument

## Description
Creates a new XML document root node. Returns an error code.

```pascal
FUNCTION CreateNewXMLDocument(
				XMLHandle       : LONGINT;
				rootElementName : STRING):INTEGER;
```

```python
def vs.CreateNewXMLDocument(XMLHandle, rootElementName):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|XMLHandle|LONGINT|   |
|rootElementName|STRING|   |

## Examples
[[VS:WriteXMLFile]] and [[VS:WriteXMLMemory]]

## See Also
SetElementValue | WriteXMLMemory | InitXML | ReleaseXML

## Version
Availability: from All Versions

## Category
* XML